%% cloud : 云模型做评价问题，输出为各对象的隶属图

% input 
% Y : 数据（m * n），m 个对象，每个对象有 n 个数据 
% N : 云滴数目

% output
% 各对象的隶属图

function [] = cloud(Y, N)

% N = 1500;	% 每幅图生成 N 个云滴

% % 射击成绩原始数据
% Y = [9.5 10.3 10.1 8.1
% 10.3 9.7 10.4 10.1
% 10.6 8.6 9.2 10.0
% 10.5 10.4 10.1 10.1
% 10.9 9.8 10.0 10.1
% 10.6 9.8 9.7 10.0
% 10.4 10.5 10.6 10.3
% 10.1 10.2 10.8 8.4
% 9.3 10.2 9.6 10.0
% 10.5 10.0 10.7 9.9]';

	for i = 1:size(Y,1)
		subplot(size(Y,1)/2,2,i);
		[x,y,Ex,En,He] = cloud_transform(Y(i,:),N);
		plot(x,y,'r.');
		% x 的横轴请修改后使用
		% xlabel('射击成绩分布/环')	
		ylabel('确定度')
		% title(strcat('第 ',num2str(i),' 人射击云模型还原图谱'))
		% axis([8,12,0,1])
	end
end
